# frozen_string_literal: true

# Combined Brewfile, differs by platform and "work_machine" status.

cask_args no_quarantine: true

tap "cloudflare/cloudflare"
tap "devhubapp/devhub"
tap "envato/envato-iamy"
tap "homebrew/cask-versions"
tap "homebrew/homebrew-cask-drivers"
tap "jacobbednarz/tap"
tap "saulpw/vd"

# {{- if eq .chezmoi.os "darwin" }}

## Macos-specific formulae

brew "coreutils"                                           # gprintf etc.
brew "fish"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "less"                                                # recommended by git-delta
brew "libffi"
brew "libyaml"
brew "mas"
brew "opensc"
brew "openssl"
brew "pinentry-mac"
brew "qemu"                                                # for qemu-img
brew "readline"
brew "switchaudio-osx"                                     # used by ~/scripts/work/home-desk.sh
brew "terminal-notifier"
brew "xz"
brew "yubico-piv-tool"

# {{ else if eq .chezmoi.os "linux" }}

## Linux-specific formulae

# {{ else }}

## WARNING:
## Unknown chezmoi.os - skipping OS specific formulae

# {{ end -}}
# {{- if eq .work_machine true }}

## Work-specific formulae

brew "ansible"
brew "aws-sso-util"                                        # experiment: AWS SSO profile management
brew "awscli"
brew "cfn-lint"
brew "cfssl"
brew "cloudflare-wrangler"
brew "cloudflare/cloudflare/cloudflared"                   # experiment: cloudflare tunnels as an ngrok replacement
brew "convox"
brew "envato/envato-iamy/iamy"                             # Envato fork of iamy
brew "mysql-client"
brew "packer"
brew "parliament"                                          # experiment: AWS IAM linter
brew "postgresql@14"
brew "principalmapper"                                     # experiment: quickly evaluate IAM permissions in AWS
brew "redis"

cask "aws-vault"                                           # cask because it needs an appropriate signature
cask "jacobbednarz/tap/cf-vault"
cask "session-manager-plugin"                              # for AWS ECS Exec/other SSM usage with the AWS CLI v2

# {{ else }}

## Skipping work-specific formulae

# {{ end -}}

## Common formulae

brew "adr-tools"
brew "age"
brew "aria2"                                               # CLI download manager (incl. torrents)
brew "asciinema"
brew "asdf"                                                # asdf specifically (v.s. rbenv etc.) required for work projects
brew "brew-gem"
brew "chezmoi"
brew "cmake"
brew "colima"                                              # experiment: Docker Desktop replacement
brew "comby"                                               # experiment: quickly update boilerplate across repos?
brew "d2"                                                  # experiment: alternative text-to-diagram tool
brew "dasel"                                               # experiment: combined jq/yq/etc. replacement
brew "direnv" if false                                     # installing direnv enables the fish completions, with no possibility of only invoking manually
brew "doggo"                                               # CLI DNS client
brew "fx"                                                  # experiment: interactive JSON processing tool
brew "gh"
brew "ghq"
brew "git-delta"                                           # experiment: better git diffs
brew "golang"
brew "hadolint"                                            # experiment: Dockerfile linting
brew "hurl"                                                # experiment: CLI and plain text file oriented Postman competitor
brew "jq"
brew "mdcat"                                               # experiment: CLI markdown viewer
brew "miller"                                              # experiment: data analysis (e.g. grouped sum on a large CSV)
brew "mitmproxy"                                           # experiment: local MITM proxying (suggested by hurl)
brew "mkcert"
brew "nss"                                                 # mkcert instructions say to install this if you use Firefox
brew "pandoc"
brew "pipx"
brew "progress"                                            # experiment: report the progress of coreutils operations (e.g. cp/dd)
brew "ripgrep"
brew "rtx"                                                 # experiment: asdf replacement
brew "saulpw/vd/visidata"                                  # experiment: tabular data multitool
brew "shellcheck"
brew "sk"
brew "sops"
brew "starship"
brew "step"                                                # experiment: certificate authority and operations
brew "structurizr-cli"                                     # experiment: architecture etc. documentation
brew "topgrade"
brew "vim"
brew "xsv"
brew "ykman"
brew "yq"                                                  # experiment: like jq for YAML

# {{- if eq .chezmoi.os "darwin" }}

# Casks and Macos apps last, because they sometimes require user input

# cask "homebrew/cask-drivers/logitech-g-hub"              # needs Rosetta

cask "elgato-control-center"                               # key light
cask "sonos"
cask "synology-drive"
cask "yubico-authenticator"

cask "homebrew/cask-fonts/font-cascadia-mono"
cask "homebrew/cask-fonts/font-cascadia-mono-pl"           # powerline version for starship etc.

cask "1password-cli"
cask "1password"
cask "balenaetcher"
cask "balsamiq-wireframes"
cask "bartender"                                           # manage top bar icons
cask "cleanshot"
cask "dash"
cask "docker"
cask "dotnet-sdk"
cask "finicky"                                             # open Meet URLs in Chrome automatically
cask "firefox"
cask "git-credential-manager"
cask "github"
cask "google-chrome"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
cask "musicbrainz-picard"
cask "openlens"
cask "paw"
cask "plexamp"
cask "proxyman"                                            # experiment: Charles proxy alternative
cask "raycast"
cask "rectangle-pro"                                       # window management app
cask "remarkable"
cask "sanesidebuttons"                                     # make mouse back/forward buttons work
cask "signal"
cask "visual-studio-code"

cask "homebrew/cask-versions/firefox-developer-edition"

mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Microsoft To Do", id: 1274495053
mas "Xcode", id: 497799835

# {{- if eq .work_machine true }}

# Work-specific Casks/Macos apps

cask "cyberduck"
cask "gather"
cask "google-drive"
cask "miro"
cask "pop"	                                               # experiment: pairing app (preferred by others)
cask "tuple"	                                             # experiment: pairing app (preferred by others)
cask "wireshark"
cask "zoom"

mas "Slack", id: 803453959
mas "Trello", id: 1278508951
# {{ end -}}
# {{ end }}
