cask_args quarantine: false

# {{ template "brewfile_helpers.tmpl" . }}

tap "grishka/grishka"

# utilities
brew "adr-tools"
brew "age"
brew "asdf" if enabled?(:asdf)
brew "awscli"
brew "boring" # trial: SSH tunnel manager
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "dasel" # trial: jq/yq replacement?
brew "fish"
brew "funzzy" # trial: watch files and run actions on change (Rust based, YAML config file support)
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-filter-repo"
brew "git-ignore" # trial: gitignore.io local client
brew "git-recent"
brew "git-trim"
brew "git-workspace" # trial: ghq alternative?
brew "git"
brew "hadolint"
brew "harlequin" # trial: tui DB client
brew "harper" # trial: local grammar tooling for programmers
brew "hgrep" # trial: "human" grep (builds on ripgrep)
brew "hurl"
brew "jq"
brew "jwt-cli"
brew "mergiraf" # trial: syntax-aware merging
brew "mise" if enabled?(:mise)
brew "mk" # trial: rrapper for auto-detecting build and test commands in a repository
brew "navi"
brew "nushell" # trial: use for scripting
brew "postgresql@16"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "sops"
brew "qman" # trial: modern man page viewer
brew "starship"
brew "static-web-server" # trial: Rust based static web server for local use cases
brew "topgrade"
brew "tpm" # trial: tmux plugin manager
brew "uv" # trial: Python packaging
brew "vim"
brew "visidata" # trial: data visualization
brew "watchman"
brew "xsv"
brew "ykman"
brew "yq"

if personal?
  tap "peterldowns/tap"

  brew "mailpit", restart_service: :changed
  brew "just"
  brew "nss" # used by localias
  brew "peterldowns/tap/localias" # trial: puma-dev replacement?
end

# build deps
brew "autoconf"
brew "gcc"
brew "gpg"
brew "libpq"
brew "libyaml"
brew "openssl"
brew "pkg-config"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

if OS.mac?
  trial "Docker Desktop alternative for work" do
    brew "colima"
    brew "docker"
    brew "docker-buildx"
    brew "docker-compose"
    brew "docker-credential-helper"
  end

  brew "pinentry-mac"
  brew "switchaudio-osx"
  brew "terminal-notifier"

  # apps
  cask "1password-cli"
  cask "1password"
  cask "alienator88-sentinel" # trial: gatekeeper utils (e.g. unquarantine app)
  cask "anytype"
  cask "aws-vault-binary" if enabled?(:aws_vault)
  cask "bartender"
  cask "docker-desktop" unless work?
  cask "firefox"
  cask "firefox@developer-edition"
  cask "ghostty" # trial: iterm2 alternative
  cask "git-credential-manager"
  cask "google-chrome"
  cask "iterm2"
  cask "jetbrains-toolbox"
  cask "obsidian" # trial: knowledge management
  cask "plexamp"
  cask "raycast"
  cask "reader"
  cask "rectangle-pro"
  cask "shottr"
  cask "sizzy"
  cask "spotify"
  cask "visual-studio-code"
  cask "yubico-authenticator"
  cask "zed" # trial: editor option

  # @todo do font casks work on Linux?
  cask "font-cascadia-mono-pl"
  cask "font-cascadia-mono"
  cask "font-caskaydia-mono-nerd-font"
  cask "font-monaspace-nerd-font"
  cask "font-monaspace"

  if desk?
    cask "elgato-control-center"
    cask "elgato-stream-deck"
  end

  if work?
    cask "google-drive"
    cask "slack" if work?
  end

  if personal?
    cask "anki"
    cask "archivewebpage"
    cask "keybase"
    cask "logseq"
    cask "neardrop" # trial: share directly from Android if on the same wifi network
    cask "onedrive"
    cask "signal"
  end

  mas "Affinity Designer 2", id: 1616831348
  mas "Affinity Photo 2", id: 1616822987
  mas "Affinity Publisher 2", id: 1606941598
  mas "reMarkable", id: 1276493162
  mas "Velja", id: 1607635845
  # mas "Xcode", id: 497799835
end
