cask_args quarantine: false

{{ template "brewfile_helpers.tmpl" . }}

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# utilities
brew "adr-tools"
brew "age"
brew "awscli"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "fish"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-filter-repo"
brew "git-recent"
brew "git-trim"
brew "git-workspace" # trial: ghq alternative?
brew "git"
brew "hadolint"
brew "hurl"
brew "jq"
brew "mise"
brew "navi"
brew "nushell" # trial: use for scripting
brew "postgresql@16", link: true
brew "shellcheck"
brew "sk"
brew "starship"
brew "topgrade"
brew "uv" # trial: Python packaging
brew "vim"
brew "watchman"
brew "xsv"
brew "yq"

# build deps
brew "autoconf"
brew "gcc"
brew "gpg"
brew "libpq"
brew "libyaml"
brew "openssl"
brew "pkg-config"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

#{{ if .work }} work formula
# end work formula {{ else }} skipping work formula{{ end }}

#{{ if eq .chezmoi.os "darwin" }}
# macos formula (.chezmoi.os == "darwin")

brew "pinentry-mac"
brew "terminal-notifier"

# homebrew casks (.chezmoi.os == "darwin")
#

# apps
cask "1password-cli"
cask "1password"
cask "acreom", args: admin_optional_cask_args
cask "bartender"
cask "firefox"
cask "git-credential-manager"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keybase", args: admin_optional_cask_args
cask "plexamp"
cask "raycast"
cask "reader"
cask "rectangle-pro", args: admin_optional_cask_args
cask "shottr"
cask "spotify"
cask "visual-studio-code"
cask "zed", args: admin_optional_cask_args

#{{ if .work}} skipping casks which require special-cased installs on work machines {{ else }}
cask "docker"
#{{ end }}

# fonts
cask "font-cascadia-mono-pl"
cask "font-cascadia-mono"
cask "font-caskaydia-mono-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-monaspace"

#{{ if .desk }} desk utilities

cask "elgato-control-center"
cask "elgato-stream-deck"

# end desk utilities {{ else }} skipping desk utilities {{ end }}

#{{ if .work }} work casks
cask "android-studio"
cask "flipper"
cask "session-manager-plugin"
# end work casks {{ else }} skipping work casks{{ end }}

#{{ if .personal }} personal casks
cask "firefox-developer-edition"
cask "logseq"
cask "signal"
# end personal casks {{ else }} skipping personal casks{{ end }}

# end casks {{ else }} skipping casks {{ end }}

#{{ if eq .chezmoi.os "darwin" }}
# mac app store apps (.chezmoi.os == "darwin")
#

mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835

# end mac app store apps {{ else }} skipping mac app store apps {{ end }}
