cask_args quarantine: false

# helpers{{printf "\n"}}{{ template "brewfile_helpers.tmpl" . }}

tap "grishka/grishka"

# utilities
brew "adr-tools"
brew "age"
brew "ast-grep" if trial "fast and polyglot tool for code structural search, lint, rewriting at large scale"
brew "awscli"
brew "boring" if trial "SSH tunnel manager"
brew "cfn-lint"
brew "chezmoi"
brew "comby" if trial "a tool for searching and changing code structure"
brew "coreutils"
brew "curl"
brew "dasel" if trial "jq/yq replacement?"
brew "doh" if trial "DNS-over-HTTP cli client"
brew "fish"
brew "funzzy" if trial "watch files and run actions on change (Rust based, YAML config file support)"
brew "gh"
brew "ghq"
brew "git-delta"
brew "git-filter-repo"
brew "git-ignore" if trial "gitignore.io local client"
brew "git-recent"
brew "git-trim"
brew "git-workspace" if trial "ghq alternative?"
brew "git"
brew "hadolint"
brew "harlequin" if trial "tui DB client"
brew "harper" if trial "local grammar tooling for programmers"
brew "hgrep" if trial "'human' grep (builds on ripgrep)"
brew "httptap" if trial "HTTP request visualizer with timing breakdown"
brew "hurl"
brew "jq"
brew "jqp" if trial "jq TUI playground"
brew "jwt-cli"
brew "mergiraf"
brew "mise"
brew "mk" if trial "wrapper for auto-detecting build and test commands in a repository"
brew "navi" if trial "CLI cheatsheets"
brew "nushell" if trial "use for scripting"
brew "postgresql@16"
brew "qman" if trial "modern man page viewer"
brew "ripgrep"
brew "rumdl" if trial "modern Markdown linter and formatter"
brew "shellcheck"
brew "shfmt"
brew "sk"
brew "sops"
brew "starship"
brew "static-web-server" if trial "Rust based static web server for local use cases"
brew "topgrade"
brew "uv" if trial "Python packaging"
brew "vim"
brew "visidata" if trial "data visualization"
brew "watchman"
brew "xsv"
brew "ykman"
brew "yq"

# build deps
brew "autoconf"
brew "gcc"
brew "gpg"
brew "libpq"
brew "libyaml"
brew "openssl"
brew "pkg-config"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"

if OS.mac?
  trial "Docker Desktop alternatives for work" do
    # brew "colima"
    brew "docker"
    brew "docker-buildx"
    brew "docker-compose"
    brew "docker-credential-helper"

    cask "finch"
  end

  brew "pinentry-mac"
  brew "switchaudio-osx"
  brew "terminal-notifier"

  # apps
  cask "1password-cli"
  cask "1password"
  cask "affinity"
  cask "alienator88-sentinel" if trial "gatekeeper utils (e.g. unquarantine app)"
  cask "anytype"
  cask "bartender"
  cask "docker-desktop" unless work?
  cask "firefox"
  cask "firefox@developer-edition"
  cask "git-credential-manager"
  cask "google-chrome"
  cask "iterm2"
  cask "jetbrains-toolbox"
  cask "lunatask" if trial "personal task management"
  cask "obsidian" if trial "knowledge management"
  cask "plexamp"
  cask "raycast"
  cask "reader"
  cask "rectangle-pro"
  cask "shottr"
  cask "sizzy"
  cask "spotify"
  cask "visual-studio-code"
  cask "yubico-authenticator"

  # @todo do font casks work on Linux?
  cask "font-cascadia-mono-pl"
  cask "font-cascadia-mono"
  cask "font-caskaydia-mono-nerd-font"
  cask "font-monaspice-nerd-font"
  cask "font-monaspace"

  mas "Affinity Designer 2", id: 1616831348
  mas "Affinity Photo 2", id: 1616822987
  mas "Affinity Publisher 2", id: 1606941598
  mas "ExcalidrawZ", id: 6636493997
  mas "reMarkable", id: 1276493162
  mas "Velja", id: 1607635845
end

if personal? && OS.mac?
  cask "anki"
  cask "archivewebpage"
  cask "keybase"
  cask "logseq"
  cask "neardrop" if trial "share directly from Android if on the same wifi network"
  cask "onedrive"
  cask "signal"
end

if desk? && OS.mac?
  cask "elgato-control-center"
  cask "elgato-stream-deck"
end

if work?
  brew "aws-sam-cli"
  brew "aws-vault"
  brew "fjira"

  cask "google-drive"
  cask "slack"
end
